{
    "case-001-step-0": "此课初传发用为辰土，这是整个判断的起点。在六壬的取象体系中，十二地支各自对应着万事万物，而辰的身份尤为特殊。它既是阳土，又是水之墓库，因此象征着水的汇聚与存储之地，如同现实世界中的水库、湖泊或沼泽。当占问天气，尤其是雨水时，代表水的类神（如亥、子、申等）固然重要，但代表水之归宿的'墓库'发用，其意义更为深远。它预示着大气中的水汽已经达到饱和，云层中积蓄了大量的水分，形成了降雨的充要条件。这不同于代表奔流江河的申子，辰更侧重于一种静态的、大量的、即将满溢的蓄水状态。因此，初传见辰，就好比看到水库的闸门已经储满了水，随时准备开闸放水。这是整个占断的第一推动力，也是判断有雨的核心基石，它定义了事件的性质——一场由水汽积聚引发的降水。",
    "case-001-step-1": "在确立了有雨的基础后，第三课'辰加申'为我们揭示了雨势的形态与过程。在这里，我们运用'类神'的思维进行深度剖析。申金，作为水的长生之地，被视为江河的源头、动态的水源，它代表着持续不断的水汽输送。而辰土，正是我们之前分析的水库。'辰加申'这一组合，在课盘上形成了一幅极其生动的画面：'水源（申）正源源不断地流入水库（辰）'。这个意象精准地描绘了雨水的形成过程。它不仅再次确认了有雨，更重要的是，它揭示了雨势的强度和持续性。水源不断补充，水库持续蓄水，这绝非零星小雨或短暂的雷阵雨，而是一场雨量充沛、持续时间较长的降水。通过这一课，我们从'有雨'的判断，升级到了'有大雨且雨势连绵'的层次。它描绘了从源头到汇聚的完整动态链条，是判断雨量大小的关键。",
    "case-001-step-2": "分析完四课三传的地盘结构，我们必须结合天将的配置来进行立体判断。天将是赋予地支以灵魂和具体情状的关键。此课日干为庚，日上神为子水，子水之上所乘的天将为玄武。玄武在六壬天将体系中，本身就属水，其性主流动、阴私、暗昧，是传统意义上的水神、雨神。现在，代表水的玄武，正好驾临在同样代表水的子水之上，这在术语上称为'将神得地'或'将临本家'，其水的属性被最大化地激发和强化了。日上为我身，代表当前所占之事的核心状态。日上见玄武乘旺水，其景象如同一个人正站在滂沱大雨之中，被雨水所包围。天将的信息（水神降临）与三传地支的信息（水局成形）形成了强有力的相互印证，使得'下雨'这一判断变得铁板钉钉，几乎再无转圜的余地。",
    "case-001-step-3": "末传是事情的归宿和最终结局。此课末传为申金，是水的长生之地。审视整个三传的流转：初传为水库（辰），中传为水之帝旺（子），末传归于长生水源（申）。这构成了一个完整而强大的申子辰三合水局，且能量流转极为特殊。它并非从长生到帝旺再到墓库的常规循环，而是以墓库发用，最终却归于长生。从生克理论的角度看，这意味着整个事件的能量流转，从开始到结束，都由'水'的能量所主导，且这股能量在达到顶峰后，并未消亡（入墓），而是返回到了其生生不息的源头。这预示着这场雨在达到顶峰之后，并不会立刻停止，其后续力量依然充足，雨势将会持续相当一段时间，是典型的'久雨'之象，而非短时降水。末传的状态，为我们准确判断降雨的持续时间提供了决定性的线索。",
    "case-002-step-0": "占问行人，首重驿马。驿马是六壬神煞系统中代表动态、变迁、远行的核心符号。此课以甲戌日占，其驿马在申，三传中出现了寅，寅申相冲，冲则动，故寅亦可视为重要的动态信息。此课初传发用为寅木，寅本身就含有'动'的意象，又与日支戌、末传戌构成寅午戌三合火局的起点，是整个事件的发动机。初传主动，直接表明所占问的行人，其本人已经有了强烈的动意，或者已经身在旅途之中。他并非静止地待在原地，而是处于一种'在路上'的状态。这是判断行人能否归来的第一步，如果课盘上毫无动象，则归期渺茫。初传见动神，为吉兆，说明事情已经开始向'归来'的方向发展。",
    "case-beijing": {
        "title": "背景",
        "content": "此课例出自《六壬神定经》。时任宰相马周在夏季久旱无雨时，请邵彦和占卜何时下雨。此为传世经典案例，展现了六壬在气象预测上的应用。"
    },
    "case-002-step-1": "日干甲木，代表占问之人。日上神，即地盘甲（寄宫在寅）之上的天盘之神，为戌土。在五行生克关系中，我克者为财。甲木克戌土，因此戌土是日干甲木的'妻财'，代表着钱财、行李、资产。现在财爻临于日上，这个意象非常丰富。首先，它表明行人此行与钱财有关，可能是经商、求财或携带了重要的财物。其次，'人带财而行'，说明行人目前状态良好，并非穷困潦倒，有一定的经济基础。这进一步印证了行人是主动出行，而非被迫流离。在判断行人是否愿意归来时，这一点很重要，一个满载而归的人，其归心自然会更加迫切。",
    "case-002-step-2": "末传为事情的最终归宿。此课末传为戌土，恰好是日上神，也是日干之财。这种'末传归日上'的格局，在行人占中是极为有利的信号，它清晰地指示了'行人最终必将回到占问者身边'的结局。整个三传从寅（动身）到午（中途）再到戌（归来），形成了一个完整的目标导向的行动链。关于应期，即具体何时归来，六壬中有多种判断方法。此课用神（代表行人的符号）和末传（代表结局）皆为戌土，力量非常集中，因此可以大胆地以戌为应期。从占问的甲戌日算起，下一个戌日便是其归来之时。这种以用神或末传地支定应期的方法，在信息明确、力量集中的课体中，准确率极高。",
    "case-003-step-0": "占失物，首先要确定丢失的是何物，即寻找'类神'。日干为丁火，代表失主。日阴神（第二课）为未土，其上所乘天将为太常。太常在天将体系中，本身就代表着衣服、布匹、宴会、文章等较为文雅、静态的物品。同时，地支未土在取象中也对应着田园、衣物、酒食。天将与地支的意象高度重合，都指向了'衣物'或'布匹'一类的东西。日阴为家中之物，第二课为妻财所临之处，因此可以初步断定，丢失的是一件衣物类的财物。这个步骤是整个占断的基础，如果连丢失的是什么都无法确定，后续的寻找方向和吉凶判断便无从谈起。",
    "case-003-step-1": "初传为事件的开端和主要动态。此课初传为丑土，为日干丁火的食神，食神发用，主有头绪，有办法去寻找。更重要的是，丑在五行中是金的墓库，而金是丁火的财星（火克金）。因此，丑土即为'财库'。'财库发用'在失物占中是一个非常积极的信号，它意味着代表财物的仓库被启动了，预示着失物并非彻底亡失，而是被收藏在某个地方，有被找到的可能。同时，丑在后天八卦中对应着艮卦，方位在东北方。初传直接指明了方向，因此，寻找失物的首要方向就是东北方。",
    "case-003-step-2": "末传代表事件的最终结果。此课末传为巳火，是日干丁火的临官禄旺之地。日干临旺，代表失主本人的运气和能力在事件的结尾阶段得到了加强。同时，巳火中藏有庚金正财，末传见财，且日干临旺可以胜任此财，这是财物最终能够被找到的决定性证据。整个三传，从丑（财库）发用，经过酉（财星长生之地），最终归于巳（日干旺地），形成了一个从'发现线索'到'财物出现'再到'失主有能力找回'的完整逻辑链。因此，可以断定，失物必能找回。"
} 