{
  "interpretations": {
    "wo_sheng_ta": {
      "title": "我生他 (泄气)",
      "summary": "能量的流出、创造与展现。犹如父母之于子女，我为源头，哺育、关爱并创造出新的事物，但自身亦有消耗。",
      "details": "在六壬关系中，“我生他”是最具创造性和表现力的格局。它象征着能量从主体（我）向客体（他）的自然流淌。这代表着一种主动的、发自内心的付出与关怀。其核心意象是“食神”与“伤官”，是我方才华、技艺、思想、言语的展现。吉时，表现为创意无限、口才出众、项目启动、产品问世，或是对下属、晚辈、学生的悉心教导与提携。此时，我方处于控制和引导地位，能够将自身的意志和才能付诸实践。然而，凡事皆有两面。生出亦意味着“泄气”，即自身能量的消耗。若我方本身气数不强，过度的生出就会导致精力衰竭、投入大于产出、为子女晚辈之事过分操劳。因此，在占断中，此格局虽主新生与机遇，却也需审视我方根本之强弱，以防泄多为灾。"
    },
    "ta_sheng_wo": {
      "title": "他生我 (印绶)",
      "summary": "能量的流入、滋养与庇护。犹如父母之于我，他为源泉，是我获得支持、资源、知识和保护的根本。",
      "details": "“他生我”是六壬关系中最具滋养与支持力量的格局。它象征着来自外部环境或他人的无私帮助与能量注入。其核心意象是“正印”与“偏印”，代表着庇护我方的力量。吉时，这股力量体现为长辈的关爱、贵人的提携、官方的文书与许可（印绶）、知识的获取、学业的成功，或是稳固的房产与靠山。在此格局下，我方处于被动接受的位置，能够轻松获得所需资源，事半功倍，化险为夷。然而，生多亦可为患。若我方本身强旺，再遇强印来生，则可能导致依赖性强、缺乏主见、思想保守、行动迟缓。过度的庇护会使人耽于安乐，不思进取，形成“母旺子衰”的局面。因此，占断中虽视其为第一吉神，但仍需结合全局，判断此“生”是否为我方当前真正所需。"
    },
    "wo_ke_ta": {
      "title": "我克他 (妻财)",
      "summary": "能量的掌控、支配与管理。我为主动方，将他方置于我的管辖与影响之下，代表着我所追求的目标与能够掌握的资源。",
      "details": "“我克他”是六壬关系中最能体现控制力与支配欲的格局。它象征着主体（我）对客体（他）的征服、管理和使用。其核心意象是“正财”与“偏财”，代表一切为我所用、所驱使的人、事、物。在人事中，这可以是我方所管理的下属、所追求的伴侣（对男性而言为妻）、所能支配的财富与项目。吉时，此格局意味着目标明确、行动力强、能够有效控制局面、获取可观的物质回报或达成既定目标。然而，“克”亦是一种对立和压制。若我方力量不足，却强行去克，则会“财多身弱”，不仅无法掌控目标，反而会因过度追逐而反受其害，导致心力交瘁、得不偿失。此外，克也意味着责任与束缚，一旦将其纳入管辖，便需承担相应的管理责任。故占断中，此格局虽主机遇与财富，但能否把握，全看自身实力是否足够强大。"
    },
    "ta_ke_wo": {
      "title": "他克我 (官鬼)",
      "summary": "能量的约束、压力与挑战。他为主动方，对我形成制约、考验甚至威胁，是官方、上司、灾患与名声的象征。",
      "details": "“他克我”是六壬关系中最具挑战性和压迫感的格局。它象征着来自外部的制约、规范与打击。其核心意象是“正官”与“七杀”（又称官鬼），代表着一切能够管制我、限制我的人、事、物。吉时，这种“克”是良性的，体现为上司的约束与提拔、法律法规的规范、社会名声的建立、事业上的职务与责任。它能使人遵纪守法、积极进取、获得公职与荣誉。此时，“官”为我用，是催人奋进的动力。然而，当克制的力量失衡或我身太弱时，“官”便化为“鬼”。这体现为来自官方的诉讼与牢狱之灾、上司的无理打压、生活中的小人作祟、挥之不去的疾病与灾祸。它是我方前进道路上最直接的障碍与威胁。因此，占断中逢此格局，必先审其强弱与善恶，以辨吉凶。克我者，既是成就我的阶梯，也可能是毁灭我的深渊。"
    },
    "wo_tong_ta": {
      "title": "我与他同 (比劫)",
      "summary": "能量的同频、合作与竞争。我与他为同类，是伙伴、是手足，亦是潜在的竞争者与分享者。",
      "details": "“我与他同”是六壬关系中最能体现平行关系与自我力量的格局。它象征着与我方五行属性相同的力量。其核心意象是“比肩”与“劫财”，代表着与我方地位对等的同辈、同事、朋友、兄弟姐妹，或是商业上的合作伙伴与竞争对手。吉时，当自身力量较弱时，比劫的出现是强大的助力，能获得朋友的帮助、团队的支持，共同分担压力，成就事业。这体现了“众志成城”的力量。然而，当自身力量已经强旺时，更多的比劫则意味着竞争加剧、资源被分夺。它们会来“劫夺”我方的财富（比劫克财）、分享我方的成果。在人事上，则可能表现为合作中的矛盾、朋友间的反目、或是因固执己见而导致的失败。因此，占断中，比劫是一把双刃剑。它既能增强我方的声势，也可能成为瓜分利益的对手。其利弊得失，全在于我方当下的处境与需求。"
    }
  }
} 